app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def add_tmdb
    temp = params[:tmdb_movies]
    if(!temp.present?)
      flash[:notice] = "No movies selected"
      redirect_to movies_path
    else
      hash = params[:tmdb_movies]
      hash.each do|i|
        Movie.create_from_tmdb(i[0])